/*
	This file is part the backup utility Mathusalem for Mac OS X.
	Copyright (C) 2008-2009 Pierre-Olivier Latour <info@pol-online.net>
	
	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.
	
	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	
	You should have received a copy of the GNU General Public License
	along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

"HELP_URL" = "http://code.google.com/p/mathusalem/w/list";

"BACKUP_NAME" = "My Backup (%i)";

"DEFAULT_BUCKET" = "my-bucket";

"VALIDATE_NAME" = "The name \"%@\" is not valid";
"VALIDATE_DIRECTORY" = "The path \"%@\" is not valid or does not exist";
"VALIDATE_SOURCE" = "Mathusalem is not designed to clone an entire disk or an entire user directory. Please select a specific directory you want to backup (you can always create multiple backups).";
"VALIDATE_HOST" = "The host \"%@\" is not valid";
"VALIDATE_PATH" = "The path \"%@\" is not valid";
"VALIDATE_DESTINATION" = "The destination \"%@\" is not unique";
"VALIDATE_BUCKET" = "The bucket \"%@\" is not valid";
"VALIDATE_PASSWORD" = "The passwords do not match";
"VALIDATE_EXECUTABLE" = "The executable \"%@\" is not valid or does not exist";

"BACKUP_REMOVE_TITLE" = "Are you sure you want to delete the selected backup?";
"BACKUP_REMOVE_DEFAULT_BUTTON" = "Cancel";
"BACKUP_REMOVE_OTHER_BUTTON" = "Delete Configuration Only";
"BACKUP_REMOVE_ALTERNATE_BUTTON" = "Delete Configuration and All Backup Files";
"BACKUP_REMOVE_MESSAGE" = "You can choose to only delete the local configuration file for the backup, or both this file and all the backup data files at the destination.";

"DELETE_FAILED_TITLE" = "One or more backup data files at the destination could not be deleted";
"DELETE_FAILED_DEFAULT_BUTTON" = "OK";

"UNSELECT_TITLE" = "Do you want to save the changes you made?";
"UNSELECT_DEFAULT_BUTTON" = "Save";
"UNSELECT_OTHER_BUTTON" = "Cancel";
"UNSELECT_ALTERNATE_BUTTON" = "Don't Save";
"UNSELECT_MESSAGE" = "Your changes will be lost if you don't save them.";

"UPDATE_TITLE" = "A new version %@ of Mathusalem is available";
"UPDATE_DEFAULT_BUTTON" = "Download Now";
"UPDATE_OTHER_BUTTON" = "Download Later";
"UPDATE_MESSAGE" = "You currently have version %@ installed. Do you want to download this new version to your Downloads directory?";

"UPDATE_SUCCESS_TITLE" = "Update successfully downloaded";
"UPDATE_SUCCESS_DEFAULT_BUTTON" = "OK";
"UPDATE_SUCCESS_MESSAGE" = "You can now quit System Preferences and double-click on the new version of the Mathusalem preference pane in your Downloads directory in order to install it.";

"UPDATE_FAILED_TITLE" = "An error occured while downloading the update";
"UPDATE_FAILED_DEFAULT_BUTTON" = "OK";
"UPDATE_FAILED_MESSAGE" = "Please try again later.";

"BUCKET_REMOVE_TITLE" = "Are you sure you want to delete the bucket \"%@\"?";
"BUCKET_REMOVE_DEFAULT_BUTTON" = "Cancel";
"BUCKET_REMOVE_OTHER_BUTTON" = "Delete Bucket";
"BUCKET_REMOVE_MESSAGE" = "Deleting the bucket will also delete all its keys.";

"CONFIRM_TITLE" = "Are you sure you want to overwrite \"%@\"?";
"CONFIRM_DEFAULT_BUTTON" = "Overwrite";
"CONFIRM_OTHER_BUTTON" = "Cancel";
"CONFIRM_MESSAGE" = "You cannot undo this operation.";

"LOADING_ENTRY" = "<LOADING...>";
"UNAVAILABLE_ENTRY" = "<NOT AVAILABLE>";
